ERP.belugaerp/src/Enums/бг_СтатусыАкцизныхМарок/бг_СтатусыАкцизныхМарок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_СтатусыАкцизныхМарок</name>
  <enumValues>
    <name>ВключенаВАктПостановкиНаБаланс</name>
  </enumValues>
  <enumValues>
    <name>ВключенаВАктСписания</name>
  </enumValues>
  <enumValues>
    <name>ВключенаВДокументВозврата</name>
  </enumValues>
  <enumValues>
    <name>ВключенаВОтгрузку</name>
  </enumValues>
  <enumValues>
    <name>ВключенаВОтчетОбУничтожении</name>
  </enumValues>
  <enumValues>
    <name>ВключенаВЭтапПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ВНаличии</name>
  </enumValues>
  <enumValues>
    <name>Возвращена</name>
  </enumValues>
  <enumValues>
    <name>Выбыла</name>
  </enumValues>
  <enumValues>
    <name>КОприходованию</name>
  </enumValues>
  <enumValues>
    <name>НаБалансе</name>
  </enumValues>
  <enumValues>
    <name>Оклеена</name>
  </enumValues>
  <enumValues>
    <name>ПодготовленаКУничтожению</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденаНаСкладе</name>
  </enumValues>
  <enumValues>
    <name>Пропущена</name>
  </enumValues>
  <enumValues>
    <name>Уничтожена</name>
  </enumValues>
  <enumValues>
    <name>ВключенаВОтгрузкуОбработаноЕГАИС</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/бг_СтатусыАкцизныхМарок/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СтатусыПоОперации(Операция) Экспорт

	СтатусыПоОперациям = СтатусыПоОперациям();
	
	Возврат СтатусыПоОперациям[Операция];

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтатусыПоОперациям()
	
	ВсеСтатусы = Перечисления.бг_СтатусыАкцизныхМарок;
	СтатусыПоОперациям = Новый Соответствие;
	
	// АктПостановкиНаБалансЕГАИС
	СтатусыПоОперации = Новый Структура;
	СтатусыПоОперации.Вставить("СтатусНаБалансе", ВсеСтатусы.НаБалансе);
	СтатусыПоОперациям.Вставить(Метаданные.Документы.АктПостановкиНаБалансЕГАИС.Имя, СтатусыПоОперации);
	
	// АктСписанияЕГАИС
	СтатусыПоОперации = Новый Структура;
	СтатусыПоОперации.Вставить("СтатусВыбыла", ВсеСтатусы.Выбыла);
	СтатусыПоОперациям.Вставить(Метаданные.Документы.АктСписанияЕГАИС.Имя, СтатусыПоОперации);
	
	// битАктОбУничтоженииФСМ
	СтатусыПоОперации = Новый Структура;
	СтатусыПоОперации.Вставить("АктОформлен", ВсеСтатусы.ВключенаВОтчетОбУничтожении);
	СтатусыПоОперации.Вставить("АктПодтвержден", ВсеСтатусы.Уничтожена);
	СтатусыПоОперациям.Вставить(Метаданные.Документы.битАктОбУничтоженииФСМ.Имя, СтатусыПоОперации);
	
	// битДанныеСПроизводственнойЛинии
	СтатусыПоОперации = Новый Структура;
	СтатусыПоОперации.Вставить("СтатусПолученыДанныеОтСПУМ", ВсеСтатусы.ВНаличии);
	СтатусыПоОперациям.Вставить(Метаданные.Документы.битДанныеСПроизводственнойЛинии.Имя, СтатусыПоОперации);
	
	// битИнвентаризацияПродукцииЕГАИС
	СтатусыПоОперации = Новый Структура;
	
	СтатусыКСписанию = Новый Массив;
	СтатусыКСписанию.Добавить(ВсеСтатусы.НаБалансе);
	СтатусыКСписанию.Добавить(ВсеСтатусы.Оклеена);
	СтатусыПоОперации.Вставить("СтатусыКСписанию", СтатусыКСписанию);
	
	СтатусыПоОперации.Вставить("СтатусСписаниеНаРасходы", ВсеСтатусы.ВключенаВАктСписания);
	СтатусыПоОперации.Вставить("СтатусОприходованиеИзлишков", ВсеСтатусы.ВключенаВАктПостановкиНаБаланс);
	
	СтатусыПоОперациям.Вставить(Метаданные.Документы.битИнвентаризацияПродукцииЕГАИС.Имя, СтатусыПоОперации);
	
	// битКомплектацияПродукцииЕГАИС
	СтатусыПоОперации = Новый Структура;
	
	СтатусыКСписанию = Новый Массив;
	СтатусыКСписанию.Добавить(ВсеСтатусы.НаБалансе);
	СтатусыКСписанию.Добавить(ВсеСтатусы.Оклеена);
	
	СтатусыПоОперации.Вставить("СтатусыККомплектации", СтатусыКСписанию);
	
	СтатусыПоОперациям.Вставить(Метаданные.Документы.битКомплектацияПродукцииЕГАИС.Имя, СтатусыПоОперации);
	
	// битОтражениеФактаПоПриходномуОрдеру
	СтатусыПоОперации = Новый Структура;
	СтатусыПоОперации.Вставить("СтатусОприходоватьНаСкладе", ВсеСтатусы.КОприходованию);
	СтатусыПоОперации.Вставить("СтатусПодтвержденаНаСкладе", ВсеСтатусы.ПодтвержденаНаСкладе);
	СтатусыПоОперациям.Вставить(Метаданные.Документы.битОтражениеФактаПоПриходномуОрдеру.Имя, СтатусыПоОперации);
	
	// битОтражениеФактаПоРасходномуОрдеру
	СтатусыПоОперации = Новый Структура;
	
	СтатусыДоВключенияВОтгрузку = Новый Массив;
	СтатусыДоВключенияВОтгрузку.Добавить(ВсеСтатусы.НаБалансе);
	СтатусыДоВключенияВОтгрузку.Добавить(ВсеСтатусы.Оклеена);
	
	СтатусыПоОперации.Вставить("СтатусыДоВключенияВОтгрузку", СтатусыДоВключенияВОтгрузку);
	СтатусыПоОперации.Вставить("СтатусВключенаВОтгрузку", ВсеСтатусы.ВключенаВОтгрузку);
	
	СтатусыПоОперациям.Вставить(Метаданные.Документы.битОтражениеФактаПоРасходномуОрдеру.Имя, СтатусыПоОперации);
	
	// битОтчетОПроизводствеЕГАИС
	СтатусыПоОперации = Новый Структура;
	СтатусыПоОперации.Вставить("ПодтвержденОтчетЕГАИС", ВсеСтатусы.Оклеена);
	СтатусыПоОперациям.Вставить(Метаданные.Документы.битОтчетОПроизводствеЕГАИС.Имя, СтатусыПоОперации);
	
	// битПереупаковка
	СтатусыПоОперации = Новый Структура;
	
	СтатусыКПереупаковке = Новый Массив;
	СтатусыКПереупаковке.Добавить(ВсеСтатусы.КОприходованию);
	СтатусыКПереупаковке.Добавить(ВсеСтатусы.ПодтвержденаНаСкладе);
	СтатусыКПереупаковке.Добавить(ВсеСтатусы.НаБалансе);
	СтатусыКПереупаковке.Добавить(ВсеСтатусы.Оклеена);
	СтатусыКПереупаковке.Добавить(ВсеСтатусы.ВключенаВОтгрузку);
	СтатусыКПереупаковке.Добавить(ВсеСтатусы.ВключенаВОтчетОбУничтожении);
	СтатусыКПереупаковке.Добавить(ВсеСтатусы.ВключенаВДокументВозврата);
	СтатусыКПереупаковке.Добавить(ВсеСтатусы.Возвращена);
	
	СтатусыПоОперации.Вставить("СтатусыКПереупаковке", СтатусыКПереупаковке);
	СтатусыПоОперациям.Вставить(Метаданные.Документы.битПереупаковка.Имя, СтатусыПоОперации);
	
	// ДвижениеПродукцииИматериалов
	СтатусыПоОперации = Новый Структура;
	СтатусыПоОперации.Вставить("ПеремещеноВБрак", ВсеСтатусы.ПодготовленаКУничтожению);
	СтатусыПоОперациям.Вставить(Метаданные.Документы.ДвижениеПродукцииИМатериалов.Имя, СтатусыПоОперации);
	
	// ТТНВходящаяЕГАИС
	СтатусыПоОперации = Новый Структура;
	СтатусыПоОперации.Вставить("СтатусОприходоватьНаСкладе", ВсеСтатусы.КОприходованию);
	СтатусыПоОперации.Вставить("СтатусПослеПотвердженияПостановкиНаБаланс", ВсеСтатусы.НаБалансе);
	СтатусыПоОперациям.Вставить(Метаданные.Документы.ТТНВходящаяЕГАИС.Имя, СтатусыПоОперации);
	
	// ТТНИсходящаяЕГАИС
	СтатусыПоОперации = Новый Структура;
	СтатусыПоОперации.Вставить("СтатусОтгружаетсяОбработаноЕГАИС", ВсеСтатусы.ВключенаВОтгрузкуОбработаноЕГАИС);
	СтатусыПоОперации.Вставить("СтатусВыбыла", ВсеСтатусы.Выбыла);
	СтатусыПоОперации.Вставить("СтатусОтгрузкаНеПодтверждена", ВсеСтатусы.НаБалансе);
	СтатусыПоОперациям.Вставить(Метаданные.Документы.ТТНИсходящаяЕГАИС.Имя, СтатусыПоОперации);
	
	// ЭтапПроизводства2_2
	СтатусыПоОперации = Новый Структура;
	СтатусыПоОперации.Вставить("ОформленВыпуск", ВсеСтатусы.ВНаличии);
	СтатусыПоОперации.Вставить("ЭтапПроизводстваЗавершен", ВсеСтатусы.ВключенаВЭтапПроизводства);
	СтатусыПоОперации.Вставить("МаркаПропущена", ВсеСтатусы.Пропущена);
	СтатусыПоОперациям.Вставить(Метаданные.Документы.ЭтапПроизводства2_2.Имя, СтатусыПоОперации);
	
	Возврат СтатусыПоОперациям;
	
КонецФункции

#КонецОбласти

#КонецЕсли
